package com.koreait.project.dto;

import lombok.AllArgsConstructor;
import lombok.Data;
import lombok.NoArgsConstructor;

@NoArgsConstructor
@AllArgsConstructor
@Data

public class Location2Dto {

	private int location2_no;
	private String location2_name;
	
	/*		서울특별시
	 * 0 : 강남구
	 * 1 : 강동구
	 * 2 : 강북구
	 * 3 : 강서구
	 * 4 : 관악구
	 * 5 : 광진구
	 * 6 : 구로구
	 * 7 : 금천구
	 * 8 : 노원구
	 * 9 : 도봉구
	 * 10 : 동대문구
	 * 11 : 동작구
	 * 12 : 마포구
	 * 13 : 서대문구
	 * 14 : 서초구
	 * 15 : 성동구
	 * 16 : 성북구
	 * 17 : 송파구
	 * 18 : 양천구
	 * 19 : 영등포구
	 * 20 : 용산구
	 * 21 : 은평구
	 * 22 : 종로구
	 * 23 : 중구
	 * 24 : 중랑구
	 * 
	 * 		인천광역시
	 * 25 : 계양구
	 * 26 : 남구
	 * 27 : 남동구
	 * 28 : 동구
	 * 29 : 부평구
	 * 30 : 서구
	 * 31 : 연수구
	 * 32 : 중구
	 * 33 : 강화군
	 * 34 : 옹진군
	 * 
	 * 		경기도
	 * 35 : 고양시
	 * 36 : 과천시
	 * 37 : 광명시
	 * 38 : 광주시
	 * 39 : 구리시
	 * 40 : 군포시
	 * 41 : 김포시
	 * 42 : 남양주시
	 * 43 : 동두천시
	 * 44 : 부천시
	 * 45 : 성남시
	 * 46 : 수원시
	 * 47 : 시흥시
	 * 48 : 안산시
	 * 49 : 안성시
	 * 50 : 안양시
	 * 51 : 양주시
	 * 52 : 오산시
	 * 53 : 용인시
	 * 54 : 의왕시
	 * 55 : 의정부시
	 * 56 : 이천시
	 * 57 : 파주시
	 * 58 : 평택시
	 * 59 : 포천시
	 * 60 : 하남시
	 * 61 : 화성시
	 * 62 : 가평군
	 * 63 : 양평군
	 * 64 : 여주군
	 * 65 : 연천군
	 */
	
}
